olayIT_Rails/app/views/home/cart.html.erb

SELECT  "squads".* FROM "squads" WHERE "squads"."id" = ? LIMIT 1  [["id", 1]]
---
		<tr>
			<td> <%= Squad.find(session[:cart_prod][i].to_i).squadname %> </td>