olayIT_Rails/app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("firstName", "lastName", "email", "phoneNumber", "address1", "address2", "city", "state", "zip", "additionalNotes", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 4]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 4]]