olayIT_Rails/app/controllers/home_controller.rb

SELECT "promotions".* FROM "promotions" WHERE (startdate <= '2016-02-21' AND enddate >= '2016-02-21')
---
  def index
    #only get active promotions
    @promotionList = Promotion.where("startdate <= ? AND enddate >= ?",  Date.today, Date.today)

SELECT "squads".* FROM "squads"
---
  def catalog
    @squads = Squad.all

SELECT "squads".* FROM "squads" WHERE (description like '%hello%')
---
  def squadSearch
    @results=0
    if !params[:searchinput].nil?
      @results=1
      @searchinput = params[:searchinput]
      @searchcriteria="%#{params[:searchinput]}%"
      @squadList = Squad.where("description like ?",@searchcriteria)

INSERT INTO "orders" ("customer_id", "saledate", "salenotes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 4], ["saledate", "2016-03-10"], ["salenotes", "[1]"], ["created_at", "2016-03-11 01:33:23.940325"], ["updated_at", "2016-03-11 01:33:23.940325"]]
SELECT  "squads".* FROM "squads" WHERE "squads"."id" = ? LIMIT 1  [["id", 1]]
---
  def checkout
    cartlen = session[:cart_prod].length
    i=0
    if cartlen > 0
      # Save new record in Order table
      # Customer ID, Sale Date and Sale Notes
      orderid = Order.create(customer_id: session[:user_id], saledate: Date.today, salenotes: session[:cart_prod].to_s)
      # For each item in the shopping cart save the record in the in OrderItem table
      while i < cartlen
        OrderItem.create(order_id: orderid, squad_id: session[:cart_prod][i].to_i, saleprice: Squad.find(session[:cart_prod][i].to_i).saleprice, prodqty: session[:cart_qty][i])