olayIT_Rails/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.all

INSERT INTO "orders" ("customer_id", "salenotes", "saledate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 3], ["salenotes", "yo"], ["saledate", "2016-02-22"], ["created_at", "2016-02-22 02:06:34.902531"], ["updated_at", "2016-02-22 02:06:34.902531"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_order
      @order = Order.find(params[:id])