olayIT_Rails/app/controllers/order_items_controller.rb

  def index
    @order_items = OrderItem.all
---
SELECT "order_items".* FROM "order_items"

  def create
    @order_item = OrderItem.new(order_item_params)

    respond_to do |format|
      if @order_item.save
---
INSERT INTO "order_items" ("order_id", "squad_id", "saleprice", "prodqty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 4], ["squad_id", 5], ["saleprice", 55.0], ["prodqty", 3], ["created_at", "2016-03-11 01:47:08.198742"], ["updated_at", "2016-03-11 01:47:08.198742"]]

  def destroy
    @order_item.destroy
---
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 1]]

    def set_order_item
      @order_item = OrderItem.find(params[:id])
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT 1  [["id", 1]]