olayIT_Rails/app/controllers/reorders_controller.rb

SELECT "reorders".* FROM "reorders"
---
  def index
    @reorders = Reorder.all