olayIT_Rails/app/controllers/reports_controller.rb

  def customerList
  	@customerList = Customer.order("lastName")
---
SELECT "customers".* FROM "customers"  ORDER BY lastname

  def productList
  	@squadList = Squad.all
---
SELECT "squads".* FROM "squads"

  def saleList
  	@saleList = Order.all
---
SELECT "orders".* FROM "orders"