olayIT_Rails/app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT "reviews".* FROM "reviews"