olayIT_Rails/app/controllers/sessions_controller.rb

  def create
  	user = Customer.find_by_username(params[:name])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."username" = ? LIMIT 1  [["username", "admin"]]