olayIT_Rails/app/controllers/squads_controller.rb

  def index
    @squads = Squad.all
---
SELECT "squads".* FROM "squads"

  def create
    @squad = Squad.new(squad_params)

    respond_to do |format|
      if @squad.save
---
INSERT INTO "squads" ("squadname", "squadimage", "description", "category_id", "saleprice", "status", "purchaseprice", "qtyonhand", "reorderpoint", "reorderqty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @squad.update(squad_params)
---
UPDATE "squads" SET "qtyonhand" = ?, "updated_at" = ? WHERE "squads"."id" = ?  [["qtyonhand", 10], ["updated_at", "2016-03-20 00:40:24.050306"], ["id", 2]]

  def destroy
    @squad.destroy
---
DELETE FROM "squads" WHERE "squads"."id" = ?  [["id", 1]]

    def set_squad
      @squad = Squad.find(params[:id])
---
SELECT  "squads".* FROM "squads" WHERE "squads"."id" = ? LIMIT 1  [["id", 2]]