olayIT_Rails/app/views/layouts/_header.html.erb

			<% else %>
				Hello <%= Customer.find(session[:user_id]).lastName %> ! <br>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 3]]